# Join, Combine and Reshape

Import library's

In [3]:
import pandas as pd
import numpy as np

## Hierarchical indexing

In [5]:
data = pd.Series(np.random.randn(9), index=[['a', 'a', 'a','b', 'b','c', 'c','d','d'],[1,2,3,1,3,1,2,2,3]])
data

a  1    0.752397
   2    0.387026
   3   -2.094431
b  1   -1.863688
   3   -0.244792
c  1   -0.281280
   2    0.650859
d  2    0.491428
   3    0.829407
dtype: float64

In [6]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [7]:
data['b']

1   -1.863688
3   -0.244792
dtype: float64

In [8]:
data['b':'c']

b  1   -1.863688
   3   -0.244792
c  1   -0.281280
   2    0.650859
dtype: float64

In [9]:
data.loc[['b','d']]

b  1   -1.863688
   3   -0.244792
d  2    0.491428
   3    0.829407
dtype: float64

In [10]:
data.loc[:,2]

a    0.387026
c    0.650859
d    0.491428
dtype: float64

In [11]:
data.unstack()

          1         2         3
a  0.752397  0.387026 -2.094431
b -1.863688       NaN -0.244792
c -0.281280  0.650859       NaN
d       NaN  0.491428  0.829407

In [12]:
data.unstack().stack()

a  1    0.752397
   2    0.387026
   3   -2.094431
b  1   -1.863688
   3   -0.244792
c  1   -0.281280
   2    0.650859
d  2    0.491428
   3    0.829407
dtype: float64

In [16]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a','a', 'b','b'],[1, 2, 1, 2]], 
                     columns=[['Ohio', 'Ohio', 'Colorado'],['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [17]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

## Reordering and Sorting levels

In [19]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [20]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [23]:
frame.swaplevel(0,1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

## Summary Statistics by Level